partitioned-pipe-two-phase/monolithic/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }

    outlet
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }

    fixedWalls
    {
        type            noSlip;
    }

    defaultFaces
    {
        type            empty;
    }
}
